[
    {
        "name": "projects",
        "projects": [

            {
                "id": 1653291,
                "name": "G-Blog",
                "desc": "Sitio Full-Stack, en la parte Front-End estoy usando TypeScript con el Framework ReactJS, NextJS, para los estilos TailwindCSS, ReduxJS para los estados globales de la aplicación. En la parte Back-end estoy usando NodeJS, ExpressJS y TypeScript con una arquitectura escalable, separando las partes de la API para poder reutilizarlas si es necesario, y separando las carpetas correctamente. Manejo los errores bastante bien y sin ocupar mucho código repetido, para facilitar la resolución de bugs y errores futuros en la API. Para la persistencia estoy usando TypeORM, con una base de datos relacional la cual es PostgresSQL, diseñando y desarrollano el modelo entidad relación. Pero para persistir las imagenes por separado, estoy usando Firebase que me brinda un fácil acceso a las mismas. También estoy usando ZOD para validar la información antes de persistirla en mi base de datos. Para la lógica principal, recurro al patrón de diseño Modelo Vista Controlador, el cúal me deriva a el patrón de servicios, esto con el objetivo de abstraer el código lo máximo posible, incluso con la ayuda de TypeORM, uso repositorios y el patrón Factory con Inyección de Dependencias para abstraer aún más mi código y reutilizarlo. Es un gran reto este proyecto, es en el que estoy trabajando actualmente, continuando aplicando mis nuevos conocimientos en el, así como practicando los que ya tenía",
                "localImg": "/assets/img/projects/construction.webp",
                "technologies": ["NodeJS", "JavaScript", "ReactJS", "NextJS", "TypeScript", "Tailwind", "TypeORM", "Sockets"],
                "redirectLinks": [
                    {
                        "id": 957914354,
                        "name": "Código",
                        "link": "https://github.com/GoRiDeveloper/G-Blog.git"
                    }
                ],
                "pathname": "g-blog",
                "rol": "Desarrollador Full-Stack, Diseñador Web y Dueño del Proyecto",
                "date": "2023"
            },
            {
                "id": 121314,
                "name": "Servidor API Rest Meddy Plus",
                "desc": "Aplicación de una clinica virtual completa, en la cual hay 3 roles, administradores, médicos y pacientes, cada uno con sus respectivas acciones dentro de la aplicación, hecha con Typescript, ReactJS, NodeJS, ExpressJS y TypeORM con PostgresSQL. Proyecto realizado gracias a No Country, en el que estoy como desarrollador Back-end, básicamente me encargue del modelado de la base de datos, con su diagrama entidad relación, la cual por motivos de una mejor lógica fue PostgreSQL. Diseñe la lógica principal de la API REST usando patrones de diseño tales como, inyección de dependencias, factory, dto y services. Me toco hacer el registro e inicio de sesión, creación de las citas médicas, endpoint para obtener esas citas médicas, gran parte de la creación de fechas de citas médicas de los médicos, creación de los registros médicos, gran parte del endpoint para editar ese registro médico, endpoint para obtener ese registro médico, endpoint para obtener la información del paciente, endpoint para obtener los médicos disponibles para citas médicas, endpoint para completar una cita médica, todos estos enpoints con sus respectivas rutas, schemas, middlewares, controllers, services y funciones para abstraer cierta lógica de esos enpoints. Tambien me encargue del manejo de errores de la aplicación y del deploy para que el Front-end pudiera utilizar facilmente distintas versiones de la aplicación, por último, tambien aporte un poco en la arquitectura de carpetas. El equipo se arriesgo a utilizar tecnologías nuevas que yo conocía, por lo cual también me encargue de instruirlos en los fundamentos principales de lo anteriormente mecionado, fortaleciendo así mis habilidades comunicación, capacidad de resolución, proactividad, organización, iniciativa y compromiso. Hubo varios retos, como cambiar una parte lógica de la API para un mejor desarrollo, pero solucionandolos con éxito. Un equipo de 8 personas con distintos roles, No Country nos da un Team Leader con el cual cada semana hacemos un sprint de los avances de la aplicación",
                "localImg": "/assets/img/projects/meddy-plus.webp",
                "technologies": ["NodeJS", "ExpressJS", "TypeScript", "TypeORM"],
                "redirectLinks": [
                    {
                        "id": 238302,
                        "name": "Sitio Web",
                        "link": "https://meddyplus.netlify.app/"
                    },
                    {
                        "id": 203832,
                        "name": "Código",
                        "link": "https://github.com/No-Country/c13-34-t-node-react"
                    }
                ],
                "pathname": "servidor-meddy-plus",
                "rol": "Desarrollador Backend y Desarrollador de Bases de Datos",
                "date": "2023"
            },
            {
                "id": 101010,
                "name": "Api Academlo Meals",
                "desc": "Esta Api REST fue el proyecto final del curso de Backend con NodeJS de Academlo. En esta Api utilice las tecnologías de NodeJS, ExpressJS, TypeScript, TypeORM, ZOD. Utilice la base de datos PostgreSQL, por lo cual opte por el ORM de TypeORM, fue un desafio propio, ya que tuve 2 semanas para aprenderme la sintaxis necesaria de TypeScript y la libreria de TypeORM, ya que fue el tiempo que tuve para terminar el proyecto, pero fue bastante divertido y un gran aprendizaje bajo presión. También use ZOD para las validaciones de usuarios. Este proyecto es mi favorito, debido a su complejidad para mi en su momento, con un super manejo de errores y una estructura escalable de carpetas. En este proyecto tambien puse en practica distintos patrones de diseño, como lo son los servicios, repositorios que ya me brindo TypeORM, dto, factory que lo sigo aprendiendo cada que lo aplico",
                "localImg": "/assets/img/projects/academlo-meals-api.webp",
                "technologies": ["NodeJS", "ExpressJS", "Typescript"],
                "redirectLinks": [
                    {
                        "id": 8525545371,
                        "name": "Código",
                        "link": "https://github.com/GoRiDeveloper/academlo-meals-api.git"
                    }
                ],
                "pathname": "academlo-meals",
                "rol": "Desarrollador Backend y Dueño del Proyecto",
                "date": "2023"
            },
            {
                "id": 9856,
                "name": "Bienestar en Fertilidad",
                "desc": "Sitio Web informativo sobre el servicio psicológico enfocado a la mujer que este transitando por dificultades en la fertilidad. Hecho con HTML, Bootstrap y SASS. Fue un proyecto en conjunto de una compañera de Coderhouse, utilizamos git y github para controlar las versiones del proyecto para manejarlo de manera más efectiva. Tuvimos buena comunicación, directa y cumpliendo los objetivos de nuestras clientas",
                "localImg": "/assets/img/projects/bienestar-web.webp",
                "technologies": ["HTML", "CSS", "JavaScript", "SASS", "Bootstrap"],
                "redirectLinks": [
                    {
                        "id": 1338546,
                        "name": "Sitio Web",
                        "link": "http://www.bienestarenfertilidad.com.ar/"
                    },
                    {
                        "id": 8934100,
                        "name": "Código",
                        "link": "https://github.com/GheraldineSalazarL/Web_Bienestar_en_Fertilidad"
                    }
                ],
                "pathname": "bienestar-en-fertilidad",
                "rol": "Desarrollador, Diseñador Web y Dueño del Proyecto",
                "date": "2023"
            },
            {
                "id": 826532,
                "name": "Contexto",
                "desc": "Sitio Web informativo sobre la venta de productos de higiene íntima reutilizables para mujeres, hecho con HTML, CSS y JavaScript. También fue un proyecto con un compañero de Coderhouse, en el cual utilizamos Git y Github para controlar las versiones del proyecto. Tuvimos buena comunicación y cumplimos con el objetivo de nuestra clienta",
                "localImg": "/assets/img/projects/contexto-web.webp",
                "technologies": ["HTML", "CSS", "JavaScript"],
                "redirectLinks": [
                    {
                        "id": 98254910324,
                        "name": "Sitio Web",
                        "link": "https://contextoweb.netlify.app/"
                    },
                    {
                        "id": 725400112,
                        "name": "Código",
                        "link": "https://github.com/GoRiDeveloper/ConTexto_Web.git"
                    }
                ],
                "pathname": "contexto",
                "rol": "Desarrollador, Diseñador Web y Dueño del Proyecto",
                "date": "2023"
            },
            {
                "id": 6542,
                "name": "GunsGR",
                "desc": "Sitio Web de un Ecommerce de armas falso, hecho con CSS y ReactJS. Utilice Firestore para la persistencia de los datos y las rutas de las imagenes, en este caso opte por usar las imagenes localmente. Este proyecto fue el proyecto final del curso de ReactJS de la carrera FullStack de Coderhouse. Fue un reto aprender React pero fue bastante satisfactorio, aprender a usar los hooks de ReactJS, estados globales con Context y varias funcionalidades que nos permite React",
                "localImg": "/assets/img/projects/gunsgr-web.webp",
                "technologies": ["ReactJS", "CSS"],
                "redirectLinks": [
                    {
                        "id": 871,
                        "name": "Sitio Web",
                        "link": "https://gunsgr.netlify.app/"
                    },
                    {
                        "id": 81630101,
                        "name": "Código",
                        "link": "https://github.com/GoRiDeveloper/Guns_Gonzalez_Rivera.git"
                    }
                ],
                "pathname": "gunsgr",
                "rol": "Desarrollador, Diseñador Web y Dueño del Proyecto",
                "date": "2023"
            }
    
        ]
    },
    {
        "name": "about",
        "about": [
            {
                "id": 2003,
                "name": "Acerca de Mi",
                "redirect": "#about"
            },
            {
                "id": 718346,
                "name": "Acerca de Éste Portafolio",
                "redirect": "https://github.com/GoRiJ/portfolio.git"
            }
        ]
    },
    {
        "name": "skills",
        "skills": [
            "typeorm",
            "bootstrap",
            "css",
            "sockets",
            "expressjs",
            "firebase",
            "git",
            "github",
            "graphql",
            "html",
            "javascript",
            "mongodb",
            "nextjs",
            "nodejs",
            "reactjs",
            "sass",
            "tailwind",
            "typescript"
        ]
    }
]